eisup_2019_docmng_integration/src/InformationRegisters/абс_СоответствияОбъектовПереноса/абс_СоответствияОбъектовПереноса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_СоответствияОбъектовПереноса</name>
  <resources>
    <name>ОбъектПриемник</name>
    <type>
      <types>String</types>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ОрганизацияИсточник</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОрганизацияПриемник</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектИсточник</name>
    <type>
      <types>DocumentRef</types>
      <types>CatalogRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПриемник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/СоответствиеПодразделенийИПодразделенийОрганизаций/СоответствиеПодразделенийИПодразделенийОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствиеПодразделенийИПодразделенийОрганизаций</name>
  <comment>Соответствие подразделений и подразделений организаций</comment>
  <dimensions>
    <name>Подразделение</name>
    <comment>Подразделение</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <comment>Организация</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПодразделениеОрганизации</name>
    <comment>Подразделение организации</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>СПоставщиком</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СПокупателем</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомитентом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СКомиссионером</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>Прочее</name>
    <comment>(Общ)</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/ДокументРасчетовСКонтрагентом/ДокументРасчетовСКонтрагентом.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ДокументРасчетовСКонтрагентом</name>
  <posting>Deny</posting>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладахБухгалтерскийУчет</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровНаСкладахНалоговыйУчет</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <comment>(Общ)</comment>
    <type>
      <types>DocumentRef.ВводНачальныхОстатковНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <comment>(Общ) </comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <comment>(Общ) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_СФ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДокументОснование</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <attributes>
    <name>ttk_Дата</name>
    <comment>(Общ) </comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ttk_Номер</name>
    <comment>(Общ) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ttk_ВнешняяКорректировкаЗапрещена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ttk_НомерСФ</name>
    <comment>(Общ) </comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>35</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ttk_ДатаСФ</name>
    <comment>(Общ) </comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

eisup_2019_docmng_integration/src/Catalogs/РасходыБудущихПериодов/РасходыБудущихПериодов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РасходыБудущихПериодов</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>РБПНаФСС</name>
      <description>РБП на взносы в ФСС по страхованию от несчастных случаев на производстве и проф. заболеваний</description>
    </items>
    <items>
      <name>РБПНаЕСН</name>
      <description>РБП на ЕСН (по 2009 год)</description>
    </items>
    <items>
      <name>РБПНаОплатуТруда</name>
      <description>РБП на оплату труда</description>
    </items>
    <items>
      <name>РБПнаСтраховыеВзносы</name>
      <description>РБП на страховые взносы</description>
    </items>
    <items>
      <name>РБПНаПФР</name>
      <description>РБП на страховые взносы на обязательное пенсионное страхование ПФР (по 2009 год)</description>
    </items>
  </predefined>
  <attributes>
    <name>ВидРБП</name>
    <type>
      <types>EnumRef.ВидыРБП</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаНачалаСписания</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончанияСписания</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппа</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.НоменклатурныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектСтроительства</name>
    <type>
      <types>CatalogRef.ОбъектыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Продукция</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияПродукции</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяЗатрат</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетБУ</name>
    <comment>(Регл)</comment>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоБУ1</name>
    <comment>(Регл)</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоБУ2</name>
    <comment>(Регл)</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоБУ3</name>
    <comment>(Регл)</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНУ</name>
    <comment>(Регл)</comment>
    <type>
      <types>ChartOfAccountsRef.Налоговый</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоНУ1</name>
    <comment>(Регл)</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоНУ2</name>
    <comment>(Регл)</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоНУ3</name>
    <comment>(Регл)</comment>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХарактеристикаПродукции</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПризнанияРасходов</name>
    <type>
      <types>EnumRef.СпособыПризнанияРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределенияЗатратНаВыпуск</name>
    <type>
      <types>CatalogRef.СпособыРаспределенияЗатратНаВыпуск</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСтроительства</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФУ</name>
    <type>
      <types>CatalogRef.абс_ЦФУ</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЦФО</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипКонтрагента</name>
    <type>
      <types>CatalogRef.абс_ТипыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипСети</name>
    <type>
      <types>CatalogRef.абс_ТипыСетей</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_БюджетнаяСтатья</name>
    <type>
      <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_КВ</name>
    <type>
      <types>CatalogRef.абс_КапитальныеВложения</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТЭО</name>
    <type>
      <types>CatalogRef.абс_ТЭО</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ТипРасхода</name>
    <type>
      <types>CatalogRef.абс_ТипыРасходовНаПроизводствоИРеализацию</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаВозникновенияРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ЭтоРБПДо2011Года</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАктива</name>
    <type>
      <types>EnumRef.ВидыАктивовДляРБП</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>РБП_ПослеМиграции</name>
    <type>
      <types>CatalogRef.РасходыБудущихПериодов</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/CommonModules/ПолныеПраваКТТК/Module.bsl
Функция ОпределитьКорректируемыйДокумент(ДоговорКонтрагента, НомерДокумента, Организация) Экспорт 
	
	//сообщить("ДоговорКонтрагента - " + ДоговорКонтрагента);
	//сообщить("НомерДокумента - " + НомерДокумента);
	//сообщить("Организация - " + Организация);
	
	абс_ИсправляемыйДокументРеализации = документы.ДокументРасчетовСКонтрагентом.ПустаяСсылка();
	Отказ = ложь;
	
	ДоговорДоМиграции = ПолучитьДоговорДоМиграции(ДоговорКонтрагента);   
	//сообщить("ДоговорДоМиграции - " + ДоговорДоМиграции);
	
	Если ЗначениеЗаполнено(ДоговорДоМиграции) Тогда
		//сообщить("Договор найден");
		
		ИсправляемыйДокументДоМиграции = ПолучитьДокументОснованиеКорректировки(ДоговорДоМиграции, НомерДокумента);
		
		ф = найти(НомерДокумента, "/");  
		Если Не ЗначениеЗаполнено(ИсправляемыйДокументДоМиграции) и ф > 0 Тогда
			
			НомерДокумента1 = Сред(НомерДокумента, ф+1, СтрДлина(НомерДокумента)-ф);   
			ИсправляемыйДокументДоМиграции = ПолучитьДокументОснованиеКорректировки(ДоговорДоМиграции, НомерДокумента1);
			
		КонецЕсли;
		
		
		//Сообщить("Корректируемый документ - " + ИсправляемыйДокументДоМиграции );
		
		
		Если ЗначениеЗаполнено(ИсправляемыйДокументДоМиграции) Тогда
			//сообщить("Документ найден");
			СтруктураПараметров = Новый Структура("Филиал,ДЗО", Организация, ДоговорДоМиграции.Организация);     
			МетаданныеДокумента = ИсправляемыйДокументДоМиграции.Метаданные();
			абс_ИсправляемыйДокументРеализации = _ПолучитьДокументРасчетов(ИсправляемыйДокументДоМиграции, СтруктураПараметров, Отказ, "",ДоговорКонтрагента,0);
		КонецЕсли;
	КонецЕсли;
	
	Возврат абс_ИсправляемыйДокументРеализации;
КонецФункции

Функция НайтиДокументОснованиеКорректировки(Организация, НомерДокумента) 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Номер = &Номер
	|	И РеализацияТоваровУслуг.Организация = &Организация");
	
	Запрос.УстановитьПараметр("Номер"		, НомерДокумента);
	Запрос.УстановитьПараметр("Организация"	, Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.Ссылка;
		
	КонецЕсли;
	
	ИскатьДокументРасчетов = Ложь;
	
	Попытка 
		ГодРеализации = Число(Лев(НомерДокумента, 2));
		//Если ГодРеализации < 11 Тогда
			ИскатьДокументРасчетов = Истина;
		//КонецЕсли;
	Исключение
	КонецПопытки;
	
	Если ИскатьДокументРасчетов Тогда
		
		Запрос = Новый Запрос(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДокументРасчетовСКонтрагентом.Ссылка
		|ИЗ
		|	Документ.ДокументРасчетовСКонтрагентом КАК ДокументРасчетовСКонтрагентом
		|ГДЕ
		|	ДокументРасчетовСКонтрагентом.Номер = &Номер
		|	И ДокументРасчетовСКонтрагентом.Организация = &Организация");
		
		Запрос.УстановитьПараметр("Номер"		, НомерДокумента);
		Запрос.УстановитьПараметр("Организация"	, Организация);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			
			Возврат Выборка.Ссылка;
			
		КонецЕсли;
	
	КонецЕсли;
	
	
	Возврат Документы.РеализацияТоваровУслуг.ПустаяСсылка();
	
КонецФункции

Функция ПолучитьДоговорДоМиграции(ДоговорПослеМиграции) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка как ДоговорДоМиграции
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ДоговорПослеМиграции = &ДоговорПослеМиграции";
	
	Запрос.УстановитьПараметр("ДоговорПослеМиграции", ДоговорПослеМиграции);
	
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.ДоговорДоМиграции;
	Иначе
		Возврат справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции 

Функция _ПолучитьДокументРасчетов(ДокументОснование, СтруктураПараметров, Отказ, Ошибки,НовыйДоговор,Сумма)

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_СоответствияОбъектовПереноса.ОбъектПриемник
	|ИЗ
	|	РегистрСведений.абс_СоответствияОбъектовПереноса КАК абс_СоответствияОбъектовПереноса
	|ГДЕ
	|	абс_СоответствияОбъектовПереноса.ОрганизацияИсточник = &Организация
	|	И абс_СоответствияОбъектовПереноса.ОрганизацияПриемник = &ОрганизацияПриемник
	|	И абс_СоответствияОбъектовПереноса.ОбъектИсточник = &ОбъектИсточник";
	
	Запрос.УстановитьПараметр("ОбъектИсточник", ДокументОснование);
	Запрос.УстановитьПараметр("Организация", СтруктураПараметров.ДЗО);
	Запрос.УстановитьПараметр("ОрганизацияПриемник", СтруктураПараметров.Филиал);
	
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.ОбъектПриемник;
	Иначе
		
		МетаданныеДокумента = ДокументОснование.Метаданные();

		Док = Документы.ДокументРасчетовСКонтрагентом.СоздатьДокумент();
		Док.Дата 				  = абс_СерверныеФункции.ПолучитьДатуСервера();
		Док.Организация           = СтруктураПараметров.Филиал;
		Док.абс_ДокументОснование = ДокументОснование;  
		Док.Контрагент            = НовыйДоговор.Владелец;
		Док.ДоговорКонтрагента    = НовыйДоговор;
		Док.ВалютаДокумента       = НовыйДоговор.ВалютаВзаиморасчетов;
		
		Если ОбщегоНазначения.ЕстьРеквизитДокумента("СуммаДокумента",МетаданныеДокумента) Тогда
			Док.СуммаДокумента = Сумма;
		КонецЕсли;
		
		Попытка
			Док.Записать(РежимЗаписиДокумента.Запись);	
		Исключение
			Сообщить("Не удалось создать документ учета взаиморасчетов по : "+Символы.ПС+ ДокументОснование +Символы.ПС+ ОписаниеОшибки());			
		КонецПопытки;
		
		абс_Филиализация.ДобавитьСоответствиеОбъектов(ДокументОснование, Док.Ссылка, "ДокументСсылка."+МетаданныеДокумента.Имя, СтруктураПараметров);
		
		Возврат Док.Ссылка;
		
	КонецЕсли;

КонецФункции 

Функция ПолучитьДокументОснованиеКорректировки(ДоговорДоМиграции, НомерДокумента);

	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РеализацияТоваровУслуг.Ссылка
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|ГДЕ
	|	РеализацияТоваровУслуг.Номер = &НомерДокумента
	|	И РеализацияТоваровУслуг.ДоговорКонтрагента = &ДоговорКонтрагента";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорДоМиграции);
	Запрос.УстановитьПараметр("НомерДокумента", НомерДокумента);
	
	Результат = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = Результат.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
		ВыборкаДетальныеЗаписи.Следующий();
		Возврат ВыборкаДетальныеЗаписи.Ссылка;
	Иначе
		Возврат документы.РеализацияТоваровУслуг.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции 

Функция ИсправляемыйДокументРеализации(СоздаемКорректировкуРеализации, ЭтоДокументПоСторно, Организация, Отказ, НомерДокумента, ДоговорКонтрагента, абс_ИсправляемыйДокументРеализации) Экспорт
		Если СоздаемКорректировкуРеализации Тогда
			абс_ИсправляемыйДокументРеализации = НайтиДокументОснованиеКорректировки(Организация, НомерДокумента);
		КонецЕсли;	
		
		//Проверяем договор на миграцию из КЦ, если была миграция, то создаем документ расчетов с контрагентами (ручной учет)
		Если (не ЗначениеЗаполнено(абс_ИсправляемыйДокументРеализации)) и ЭтоДокументПоСторно Тогда
			
			ДоговорДоМиграции = ПолучитьДоговорДоМиграции(ДоговорКонтрагента);
			
			Если ЗначениеЗаполнено(ДоговорДоМиграции) Тогда
				ИсправляемыйДокументДоМиграции = ПолучитьДокументОснованиеКорректировки(ДоговорДоМиграции, НомерДокумента);
			
				Если ЗначениеЗаполнено(ИсправляемыйДокументДоМиграции) Тогда
					СтруктураПараметров = Новый Структура("Филиал,ДЗО", Организация, ДоговорДоМиграции.Организация);					
					МетаданныеДокумента = ИсправляемыйДокументДоМиграции.Метаданные();
					абс_ИсправляемыйДокументРеализации = _ПолучитьДокументРасчетов(ИсправляемыйДокументДоМиграции, СтруктураПараметров, Отказ, "",ДоговорКонтрагента,0);
				КонецЕсли;
			КонецЕсли;
	
		КонецЕсли;

	Возврат  ЗначениеЗаполнено(абс_ИсправляемыйДокументРеализации)	
КонецФункции

// {{ТТК Лапин А. Заявка № 32998 27.07.2015 начало

// непосредственно Осуществляет перенос выбранных элементов Номенклатуры в 
// в группу с наименованием "Номенклатура для отправки в архив" и кодом "10000247582"
// без контроля прав пользователями с ограничениями
Процедура ПереносВГруппу(ТаблицаНоменклатуры = Неопределено,СчетчикКолваПеренесенныхЭлементов) Экспорт
	
	Если ТаблицаНоменклатуры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	СчетчикКолваПеренесенныхЭлементов = 0;
	
	//перенос в группу с наименованием "Номенклатура для отправки в архив" и кодом "10000247582"
	УстановитьРодителя = Справочники.Номенклатура.НайтиПоКоду("10000247582");
	
	Для Каждого СтрТЗ ИЗ ТаблицаНоменклатуры Цикл
		СпрСсылка = СтрТЗ.Ссылка;
		СпрОбъект = СпрСсылка.ПолучитьОбъект();
		СпрОбъект.Родитель = УстановитьРодителя;
		СпрОбъект.ОбменДанными.Загрузка = Истина;
		СпрОбъект.Записать();
		СпрОбъект.ОбменДанными.Загрузка = Ложь;
		//Сообщить("Элемент """ + СпрСсылка.Наименование + """ с кодом " + СпрСсылка.Код + " перенесен в группу ""_Новая номенклатура (с 12.02.11)\Номенклатура для отправки в архив"" ");
		
		СчетчикКолваПеренесенныхЭлементов = СчетчикКолваПеренесенныхЭлементов + 1;
		
	КонецЦикла;
	
	
КонецПроцедуры // ПереносВГруппу(ТаблицаНоменклатуры) 
//}}ТТК Лапин А. Заявка № 32998 27.07.2015 окончание

// {{ТТК Лапин А. 17.08.2015 начало
Функция ПолучитьСоздатьДоговорСПокупателемПоНомеруИОрганизации(Номер, КонтрагентВладелец, ОрганизацияПринимающая, ДоговорИсточник) Экспорт
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.Номер = &Номер";
	
	ДоговорСПокупателем = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
 	Запрос2.УстановитьПараметр("ВидДоговора",ДоговорСПокупателем);
	
	Если ЗначениеЗаполнено(ОрганизацияПринимающая) И
		ЗначениеЗаполнено(Номер) Тогда
		
		Запрос2.УстановитьПараметр("Организация", ОрганизацияПринимающая);
		Запрос2.УстановитьПараметр("Владелец",КонтрагентВладелец);
 		Запрос2.УстановитьПараметр("Номер", Номер);
		
		РезультатЗапроса = Запрос2.Выполнить().Выгрузить();
		
		
		Если РезультатЗапроса.Количество() = 0 Тогда
			//создать
			НовыйДоговор = Справочники.ДоговорыКонтрагентов.СоздатьЭлемент();
			НовыйДоговор = ДоговорИсточник.Скопировать();
			
			НовыйДоговор.УстановитьНовыйКод("к");
			НовыйДоговор.Организация  = ОрганизацияПринимающая;
			//НовыйДоговор.Владелец     = СтрТЧ.Контрагент;
			//НовыйДоговор.Наименование = СтрТЧ.Договор.Наименование;  // ""+СтрТЧ.Договор.Номер + " от "+Стр.Дата;
			//НовыйДоговор.Номер        = СтрТЧ.Номер;
			
			НовыйДоговор.ОбменДанными = Истина;
			НовыйДоговор.Записать();
			НовыйДоговор.ОбменДанными = Ложь;
			
			// теперь запишем ссылку в реквизит "ДоговорПослеМиграции" у договора по ТТК
			
			ТекДогОбъект = ДоговорИсточник.ПолучитьОбъект();
			ТекДогОбъект.ДоговорПослеМиграции = НовыйДоговор.Ссылка;
			ТекДогОбъект.ОбменДанными.Загрузка = Истина;
			ТекДогОбъект.Записать();
			ТекДогОбъект.ОбменДанными.Загрузка = Ложь;
			
			//СтрТЧ.ДоговорПриемник = НовыйДоговор.Ссылка;
			//Сообщить("создан новый договор-приемник и подставлен в табличную часть " + НовыйДоговор.Ссылка + " и текущему договору прописана ссылка в реквизит ""ДоговорПослеМиграции""");
			
			Возврат НовыйДоговор.Ссылка;
			
		ИначеЕсли РезультатЗапроса.Количество() = 1 Тогда
			//заполним
			ДоговорПриемник = РезультатЗапроса.Получить(0).Ссылка;
			
			ТекДогОбъект = ДоговорИсточник.ПолучитьОбъект();
			ТекДогОбъект.ДоговорПослеМиграции = ДоговорПриемник.Ссылка;
			ТекДогОбъект.ОбменДанными.Загрузка = Истина;
			ТекДогОбъект.Записать();
			ТекДогОбъект.ОбменДанными.Загрузка = Ложь;
			
			Возврат ДоговорПриемник.Ссылка;

		Иначе
			// ОСТАВЛЯЕМ НА УСМОТРЕНИЕ И ВЫБОР ПОЛЬЗОВАТЕЛЯ
			// М.Б. ДАЖЕ ПРЕДВАРИТЕЛЬНЫЙ ОТБОР ПОСТАВИТЬ
			//Сообщить("Найдено более одного договора");
		КонецЕсли;
	   		
	Иначе
		
		Возврат Неопределено;  // проблема
			
	КонецЕсли;
		
			
КонецФункции

//}}ТТК Лапин А. 17.08.2015 окончание


// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
// {{KM WARE Лазаревский К.В. Заявка № 01.09.2015 начало
Функция ПолучитьСоздатьРБП(РБПИсточник, ОрганизацияПринимающая) Экспорт
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	абс_СоответствияОбъектовПереноса.ОбъектПриемник
	|ИЗ
	|	РегистрСведений.абс_СоответствияОбъектовПереноса КАК абс_СоответствияОбъектовПереноса
	|ГДЕ
	|	абс_СоответствияОбъектовПереноса.ОрганизацияИсточник = &ОрганизацияИсточник
	|	И абс_СоответствияОбъектовПереноса.ОрганизацияПриемник = &ОрганизацияПриемник
	|	И абс_СоответствияОбъектовПереноса.ОбъектИсточник = &ОбъектИсточник";
	
 	Запрос2.УстановитьПараметр("ОбъектИсточник", РБПИсточник);
	
	Если ЗначениеЗаполнено(ОрганизацияПринимающая)  Тогда
		
		Запрос2.УстановитьПараметр("ОрганизацияИсточник", РБПИсточник.ПодразделениеОрганизации.Владелец);
		Запрос2.УстановитьПараметр("ОрганизацияПриемник", ОрганизацияПринимающая);
		
		РезультатЗапроса = Запрос2.Выполнить().Выгрузить();
		
		
		Если РезультатЗапроса.Количество() = 0 Тогда
			ГруппаРодитель = Справочники.РасходыБудущихПериодов.НайтиПоНаименованию(ОрганизацияПринимающая.Наименование);
			Если Не ЗначениеЗаполнено(ГруппаРодитель) Тогда
				ГруппаРодитель = Справочники.РасходыБудущихПериодов.НайтиПоНаименованию("_"+ОрганизацияПринимающая.Наименование);
			КонецЕсли;	
			
			
			//создать
			НовыйДоговор = Справочники.РасходыБудущихПериодов.СоздатьЭлемент();
			НовыйДоговор = РБПИсточник.Скопировать();
			НовыйДоговор.Родитель = ГруппаРодитель;
			НовыйДоговор.УстановитьНовыйКод("к");
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	СоответствиеПодразделенийИПодразделенийОрганизаций.ПодразделениеОрганизации
			                      |ИЗ
			                      |	РегистрСведений.СоответствиеПодразделенийИПодразделенийОрганизаций КАК СоответствиеПодразделенийИПодразделенийОрганизаций
			                      |ГДЕ
			                      |	СоответствиеПодразделенийИПодразделенийОрганизаций.Подразделение = &Подразделение
			                      |	И СоответствиеПодразделенийИПодразделенийОрганизаций.Организация = &Организация");
			Запрос.УстановитьПараметр("Организация",   ОрганизацияПринимающая);
			Запрос.УстановитьПараметр("Подразделение", РБПИсточник.Подразделение);
			Рез = Запрос.Выполнить().Выбрать();
			Если Рез.Следующий() Тогда
				НовыйДоговор.ПодразделениеОрганизации = Рез.ПодразделениеОрганизации;
			КонецЕсли;
			
//			НовыйДоговор.Организация  = ОрганизацияПринимающая;
			
			НовыйДоговор.ОбменДанными = Истина;
			НовыйДоговор.Записать();
			НовыйДоговор.ОбменДанными = Ложь;
			
			// теперь запишем ссылку в реквизит "ДоговорПослеМиграции" у договора по ТТК
			ЗаписьРегистра = РегистрыСведений.абс_СоответствияОбъектовПереноса.СоздатьМенеджерЗаписи();
			ЗаписьРегистра.ОрганизацияИсточник = РБПИсточник.ПодразделениеОрганизации.Владелец;
			ЗаписьРегистра.ОрганизацияПриемник = ОрганизацияПринимающая;
			ЗаписьРегистра.ОбъектИсточник      = РБПИсточник;
			ЗаписьРегистра.ОбъектПриемник      = НовыйДоговор.Ссылка;
			ЗаписьРегистра.ТипПриемник         = "СправочникСсылка.РасходыБудущихПериодов";
			ЗаписьРегистра.Записать();
			//ТекДогОбъект = РБПИсточник.ПолучитьОбъект();
			//ТекДогОбъект.РБП_ПослеМиграции = НовыйДоговор.Ссылка;
			//ТекДогОбъект.ОбменДанными.Загрузка = Истина;
			//ТекДогОбъект.Записать();
			//ТекДогОбъект.ОбменДанными.Загрузка = Ложь;
			
			
			Возврат НовыйДоговор.Ссылка;
			
		ИначеЕсли РезультатЗапроса.Количество() = 1 Тогда
			//заполним
			ДоговорПриемник = РезультатЗапроса.Получить(0).ОбъектПриемник;
			
			//ТекДогОбъект = РБПИсточник.ПолучитьОбъект();
			//ТекДогОбъект.РБП_ПослеМиграции = ДоговорПриемник.Ссылка;
			//ТекДогОбъект.ОбменДанными.Загрузка = Истина;
			//ТекДогОбъект.Записать();
			//ТекДогОбъект.ОбменДанными.Загрузка = Ложь;
			
			Возврат ДоговорПриемник.Ссылка;

		Иначе
			// ОСТАВЛЯЕМ НА УСМОТРЕНИЕ И ВЫБОР ПОЛЬЗОВАТЕЛЯ
			// М.Б. ДАЖЕ ПРЕДВАРИТЕЛЬНЫЙ ОТБОР ПОСТАВИТЬ
			//Сообщить("Найдено более одного договора");
		КонецЕсли;
	   		
	Иначе
		
		Возврат Неопределено;  // проблема
			
	КонецЕсли;
		
			
КонецФункции

 // ПолучитьСоздатьСклады() }}KM WARE Лазаревский К.В. Заявка № 01.09.2015 окончание
// <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
// {{KM WARE Лазаревский К.В. Заявка №34656 23.11.2015 начало
Функция ПолучитьСоздатьСклад(СкладИсточник, ОрганизацияИсточник, ОрганизацияПринимающая) Экспорт
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	абс_СоответствияОбъектовПереноса.ОбъектПриемник
	|ИЗ
	|	РегистрСведений.абс_СоответствияОбъектовПереноса КАК абс_СоответствияОбъектовПереноса
	|ГДЕ
	|	абс_СоответствияОбъектовПереноса.ОрганизацияИсточник = &ОрганизацияИсточник
	|	И абс_СоответствияОбъектовПереноса.ОрганизацияПриемник = &ОрганизацияПриемник
	|	И абс_СоответствияОбъектовПереноса.ОбъектИсточник = &ОбъектИсточник";
	
 	Запрос2.УстановитьПараметр("ОбъектИсточник", СкладИсточник);
	Запрос2.УстановитьПараметр("ОрганизацияИсточник", ОрганизацияИсточник);
	Запрос2.УстановитьПараметр("ОрганизацияПриемник", ОрганизацияПринимающая);
	
	Если ЗначениеЗаполнено(ОрганизацияПринимающая)  Тогда
		
		
		РезультатЗапроса = Запрос2.Выполнить().Выгрузить();
		
		
		Если РезультатЗапроса.Количество() = 0 Тогда
			ГруппаРодитель = Справочники.Склады.НайтиПоНаименованию(ОрганизацияПринимающая.Наименование);
			Если Не ЗначениеЗаполнено(ГруппаРодитель) Тогда
				ГруппаРодитель = Справочники.Склады.НайтиПоНаименованию("_"+ОрганизацияПринимающая.Наименование);
			КонецЕсли;	
			
			
			//создать
			НовыйДоговор = Справочники.Склады.СоздатьЭлемент();
			НовыйДоговор = СкладИсточник.Скопировать();
			НовыйДоговор.Родитель = ГруппаРодитель;
			НовыйДоговор.УстановитьНовыйКод(ОрганизацияПринимающая.Префикс);
			
			НовыйДоговор.ОбменДанными = Истина;
			НовыйДоговор.Записать();
			НовыйДоговор.ОбменДанными = Ложь;
			
			// теперь запишем ссылку в реквизит "ДоговорПослеМиграции" у договора по ТТК
			ЗаписьРегистра = РегистрыСведений.абс_СоответствияОбъектовПереноса.СоздатьМенеджерЗаписи();
			ЗаписьРегистра.ОрганизацияИсточник = ОрганизацияИсточник;
			ЗаписьРегистра.ОрганизацияПриемник = ОрганизацияПринимающая;
			ЗаписьРегистра.ОбъектИсточник      = СкладИсточник;
			ЗаписьРегистра.ОбъектПриемник      = НовыйДоговор.Ссылка;
			ЗаписьРегистра.ТипПриемник         = "СправочникСсылка.Склады";
			ЗаписьРегистра.Записать();
			
			Возврат НовыйДоговор.Ссылка;
			
		ИначеЕсли РезультатЗапроса.Количество() = 1 Тогда
			//заполним
			ДоговорПриемник = РезультатЗапроса.Получить(0).ОбъектПриемник;
			
			Возврат ДоговорПриемник.Ссылка;

		Иначе
			// ОСТАВЛЯЕМ НА УСМОТРЕНИЕ И ВЫБОР ПОЛЬЗОВАТЕЛЯ
			// М.Б. ДАЖЕ ПРЕДВАРИТЕЛЬНЫЙ ОТБОР ПОСТАВИТЬ
			//Сообщить("Найдено более одного договора");
		КонецЕсли;
	   		
	Иначе
		
		Возврат Неопределено;  // проблема
			
	КонецЕсли;
		
			
КонецФункции
 // ПолучитьСоздатьСклады() }}KM WARE Лазаревский К.В. Заявка №34656 23.11.2015 окончание
 
 // <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
// {{KM WARE Лазаревский К.В. Заявка № 01.09.2015 начало
Функция ПолучитьСоздатьНоменклатурыеГруппыСтроительство(НомГруппаИсточник, ОрганизацияПринимающая) Экспорт
	ГруппаСтроительство = Справочники.НоменклатурныеГруппы.НайтиПоКоду("Строительство13");
	ЗапросПрверкаНаСтроительство = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	                                            |	1 КАК Поле1
	                                            |ИЗ
	                                            |	Справочник.НоменклатурныеГруппы КАК НоменклатурныеГруппы
	                                            |ГДЕ
	                                            |	НоменклатурныеГруппы.Ссылка = &Ссылка
	                                            |	И НоменклатурныеГруппы.Ссылка В ИЕРАРХИИ(&Строительство)");
	ЗапросПрверкаНаСтроительство.УстановитьПараметр("Ссылка",        НомГруппаИсточник);
	ЗапросПрверкаНаСтроительство.УстановитьПараметр("Строительство", ГруппаСтроительство);
	Рез = ЗапросПрверкаНаСтроительство.Выполнить();
	Если Рез.Пустой() Тогда
		Возврат НомГруппаИсточник;
	КонецЕсли;
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	абс_СоответствияОбъектовПереноса.ОбъектПриемник
	|ИЗ
	|	РегистрСведений.абс_СоответствияОбъектовПереноса КАК абс_СоответствияОбъектовПереноса
	|ГДЕ
	|	абс_СоответствияОбъектовПереноса.ОрганизацияИсточник = &ОрганизацияИсточник
	|	И абс_СоответствияОбъектовПереноса.ОрганизацияПриемник = &ОрганизацияПриемник
	|	И абс_СоответствияОбъектовПереноса.ОбъектИсточник = &ОбъектИсточник";
	
 	Запрос2.УстановитьПараметр("ОбъектИсточник", НомГруппаИсточник);
	
	Если ЗначениеЗаполнено(ОрганизацияПринимающая)  Тогда
		
		Запрос2.УстановитьПараметр("ОрганизацияИсточник", НомГруппаИсточник.Организация);
		Запрос2.УстановитьПараметр("ОрганизацияПриемник", ОрганизацияПринимающая);
		
		РезультатЗапроса = Запрос2.Выполнить().Выгрузить();
		
		
		Если РезультатЗапроса.Количество() = 0 Тогда
			ГруппаРодитель = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(ОрганизацияПринимающая.Наименование, Ложь, ГруппаСтроительство);
			Если Не ЗначениеЗаполнено(ГруппаРодитель) Тогда
				ГруппаРодитель = Справочники.РасходыБудущихПериодов.НайтиПоНаименованию("_"+ОрганизацияПринимающая.Наименование, Ложь, ГруппаСтроительство);
			КонецЕсли;	
			
			
			//создать
			НовыйДоговор = Справочники.НоменклатурныеГруппы.СоздатьЭлемент();
			НовыйДоговор = НомГруппаИсточник.Скопировать();
			НовыйДоговор.Родитель = ГруппаРодитель;
			НовыйДоговор.УстановитьНовыйКод("к");
			
			НовыйДоговор.Организация  = ОрганизацияПринимающая;
			
			НовыйДоговор.ОбменДанными = Истина;
			НовыйДоговор.Записать();
			НовыйДоговор.ОбменДанными = Ложь;
			
			// теперь запишем ссылку в реквизит "ДоговорПослеМиграции" у договора по ТТК
			ЗаписьРегистра = РегистрыСведений.абс_СоответствияОбъектовПереноса.СоздатьМенеджерЗаписи();
			ЗаписьРегистра.ОрганизацияИсточник = НомГруппаИсточник.Организация;
			ЗаписьРегистра.ОрганизацияПриемник = ОрганизацияПринимающая;
			ЗаписьРегистра.ОбъектИсточник      = НомГруппаИсточник;
			ЗаписьРегистра.ОбъектПриемник      = НовыйДоговор.Ссылка;
			ЗаписьРегистра.ТипПриемник         = "СправочникСсылка.НоменклатурныеГруппы";
			ЗаписьРегистра.Записать();
			//ТекДогОбъект = РБПИсточник.ПолучитьОбъект();
			//ТекДогОбъект.РБП_ПослеМиграции = НовыйДоговор.Ссылка;
			//ТекДогОбъект.ОбменДанными.Загрузка = Истина;
			//ТекДогОбъект.Записать();
			//ТекДогОбъект.ОбменДанными.Загрузка = Ложь;
			
			
			Возврат НовыйДоговор.Ссылка;
			
		ИначеЕсли РезультатЗапроса.Количество() = 1 Тогда
			//заполним
			ДоговорПриемник = РезультатЗапроса.Получить(0).ОбъектПриемник;
			
			//ТекДогОбъект = НоменклатурныеГруппы.ПолучитьОбъект();
			//ТекДогОбъект.РБП_ПослеМиграции = ДоговорПриемник.Ссылка;
			//ТекДогОбъект.ОбменДанными.Загрузка = Истина;
			//ТекДогОбъект.Записать();
			//ТекДогОбъект.ОбменДанными.Загрузка = Ложь;
			
			Возврат ДоговорПриемник.Ссылка;

		Иначе
			// ОСТАВЛЯЕМ НА УСМОТРЕНИЕ И ВЫБОР ПОЛЬЗОВАТЕЛЯ
			// М.Б. ДАЖЕ ПРЕДВАРИТЕЛЬНЫЙ ОТБОР ПОСТАВИТЬ
			//Сообщить("Найдено более одного договора");
		КонецЕсли;
	   		
	Иначе
		
		Возврат Неопределено;  // проблема
			
	КонецЕсли;
		
			
КонецФункции

 // ПолучитьСоздатьНоменклатурыеГруппыСтроительство() }}KM WARE Лазаревский К.В. Заявка № 01.09.2015 окончание
 
  // <Описание функции>
//
// Параметры
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
// {{KM WARE Лазаревский К.В. Заявка № 01.09.2015 начало
Функция ПолучитьСоздатьОбъектыСтроительство(ОбъектСтроительствоИсточник, ОрганизацияПринимающая, ОрганизацияИсточник) Экспорт
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст = 
	"ВЫБРАТЬ
	|	абс_СоответствияОбъектовПереноса.ОбъектПриемник
	|ИЗ
	|	РегистрСведений.абс_СоответствияОбъектовПереноса КАК абс_СоответствияОбъектовПереноса
	|ГДЕ
	|	абс_СоответствияОбъектовПереноса.ОрганизацияИсточник = &ОрганизацияИсточник
	|	И абс_СоответствияОбъектовПереноса.ОрганизацияПриемник = &ОрганизацияПриемник
	|	И абс_СоответствияОбъектовПереноса.ОбъектИсточник = &ОбъектИсточник";
	
 	Запрос2.УстановитьПараметр("ОбъектИсточник",      ОбъектСтроительствоИсточник);
 	Запрос2.УстановитьПараметр("ОрганизацияПриемник", ОрганизацияПринимающая);
 	Запрос2.УстановитьПараметр("ОрганизацияИсточник", ОрганизацияИсточник);
	
	Если ЗначениеЗаполнено(ОрганизацияПринимающая)  Тогда
		
		РезультатЗапроса = Запрос2.Выполнить().Выгрузить();
		
		
		Если РезультатЗапроса.Количество() = 0 Тогда
			ГруппаРодитель = Справочники.НоменклатурныеГруппы.НайтиПоНаименованию(СтрЗаменить(ОрганизацияПринимающая.Наименование, "Макрорегион", "МР"));
			Если Не ЗначениеЗаполнено(ГруппаРодитель) Тогда
				ГруппаРодитель = Справочники.РасходыБудущихПериодов.НайтиПоНаименованию("_"+ОрганизацияПринимающая.Наименование);
			КонецЕсли;	
			
			
			//создать
			НовыйДоговор = Справочники.ОбъектыСтроительства.СоздатьЭлемент();
			НовыйДоговор = ОбъектСтроительствоИсточник.Скопировать();
			НовыйДоговор.Родитель = ГруппаРодитель;
			НовыйДоговор.УстановитьНовыйКод("к");
			
			НовыйДоговор.Организация  = ОрганизацияПринимающая;
			
			НовыйДоговор.ОбменДанными = Истина;
			НовыйДоговор.Записать();
			НовыйДоговор.ОбменДанными = Ложь;
			
			// теперь запишем ссылку в реквизит "ДоговорПослеМиграции" у договора по ТТК
			ЗаписьРегистра = РегистрыСведений.абс_СоответствияОбъектовПереноса.СоздатьМенеджерЗаписи();
			ЗаписьРегистра.ОрганизацияИсточник = ОрганизацияИсточник;
			ЗаписьРегистра.ОрганизацияПриемник = ОрганизацияПринимающая;
			ЗаписьРегистра.ОбъектИсточник      = ОбъектСтроительствоИсточник;
			ЗаписьРегистра.ОбъектПриемник      = НовыйДоговор.ссылка;
			ЗаписьРегистра.ТипПриемник         = "СправочникСсылка.ОбъектыСтроительства";
			ЗаписьРегистра.Записать();
			//ТекДогОбъект = РБПИсточник.ПолучитьОбъект();
			//ТекДогОбъект.РБП_ПослеМиграции = НовыйДоговор.Ссылка;
			//ТекДогОбъект.ОбменДанными.Загрузка = Истина;
			//ТекДогОбъект.Записать();
			//ТекДогОбъект.ОбменДанными.Загрузка = Ложь;
			
			
			Возврат НовыйДоговор;
			
		ИначеЕсли РезультатЗапроса.Количество() = 1 Тогда
			//заполним
			//ДоговорПриемник = РезультатЗапроса.Получить(0).ОбъектПриемник;
			
			//ТекДогОбъект = НоменклатурныеГруппы.ПолучитьОбъект();
			//ТекДогОбъект.РБП_ПослеМиграции = ДоговорПриемник.Ссылка;
			//ТекДогОбъект.ОбменДанными.Загрузка = Истина;
			//ТекДогОбъект.Записать();
			//ТекДогОбъект.ОбменДанными.Загрузка = Ложь;
			
			Возврат РезультатЗапроса.ОбъектПриемник;

		Иначе
			// ОСТАВЛЯЕМ НА УСМОТРЕНИЕ И ВЫБОР ПОЛЬЗОВАТЕЛЯ
			// М.Б. ДАЖЕ ПРЕДВАРИТЕЛЬНЫЙ ОТБОР ПОСТАВИТЬ
			//Сообщить("Найдено более одного договора");
		КонецЕсли;
	   		
	Иначе
		
		Возврат Неопределено;  // проблема
			
	КонецЕсли;
		
			
КонецФункции

 // ПолучитьСоздатьобъектыСтроительство() }}KM WARE Лазаревский К.В. Заявка № 01.09.2015 окончание
